<template>
	<div>
		<h2>Стартовая страница</h2>

		<p>Привет! <br> Это попытка написания простого todo-app на фреймворке Vue.js. Сами задачи грузятся с фейкового REST API сервиса. Для демонстрации лоадера добавлена специальная задержка в отображении загруженных задач в 1 секунду.</p>
		<p>Попробовал применить роутинг, кроме всего прочего, так что, чтобы перейти к самому планировщике, просто кликни по ссылке ниже:</p>

		<router-link to="/todos">Планировщик</router-link>
	</div>
</template>

<style scoped>
p {
	width: 60%;
	margin: 20px auto;
}

:link {
	text-decoration: none;
	color: rgb(92, 170, 219);
}

:visited {
	color: rgb(92, 170, 219);
}
</style>